[
  {
    "id": 1,
    "name": "American Beaver",
    "species": "Castor canadensis",
    "type": "Mammal",
    "region": "Continental US, Canada, southern Alaska, northern Mexico",
    "habitat": "Lakes, streams, rivers, and wetlands in boreal and temperate forests",
    "stats": {
      "size": 75,
      "speed": 35,
      "rarity": 20,
      "danger": 15
    },
    "description": "This industrious rodent can fell trees with its continuously-growing incisors and construct dams over half a mile long, with the largest known dam discovered via satellite at 2,790 feet—more than twice the width of the Hoover Dam. Nearly hunted to extinction for its waterproof fur, it can remain submerged for up to 15 minutes and stores winter food underwater for months.",
    "image": "images/animals/001.jpg"
  },
  {
    "id": 2,
    "name": "Mountain Beaver",
    "species": "Aplodontia rufa",
    "type": "Mammal",
    "region": "Pacific Northwest and California mountains (Cascades, Sierra Nevada, coastal ranges)",
    "habitat": "Temperate rainforests and moist mountain regions with deep soil for burrowing",
    "stats": {
      "size": 28,
      "speed": 15,
      "rarity": 22,
      "danger": 2
    },
    "description": "Despite its misleading name, this primitive rodent is more closely related to squirrels than true beavers, and is the only living mammal with uniquely angled molar projections that point toward the cheek on upper teeth but toward the tongue below. Unable to concentrate urine and restricted to wet habitats, it forages up to 9 hours daily on ferns and toxic vegetation that would kill other animals.",
    "image": "images/animals/002.jpg"
  },
  {
    "id": 3,
    "name": "Nine-banded Armadillo",
    "species": "Dasypus novemcinctus",
    "type": "Mammal",
    "region": "Southeastern US, expanding northward to Ohio and Pennsylvania",
    "habitat": "Grasslands, rainforests, scrublands, and tropical dry forests",
    "stats": {
      "size": 35,
      "speed": 45,
      "rarity": 20,
      "danger": 10
    },
    "description": "When startled, this armored mammal can jump 3-4 feet straight into the air and holds its breath for up to six minutes while foraging underground for insects. Its high reproductive rate—producing up to 56 offspring over a lifetime—has allowed it to rapidly expand its range northward across the United States.",
    "image": "images/animals/003.jpg"
  },
  {
    "id": 4,
    "name": "North American Porcupine",
    "species": "Erethizon dorsatum",
    "type": "Mammal",
    "region": "Canada to Mexico, eastern North America to Alaska",
    "habitat": "Coniferous and mixed forests, shrublands, tundra",
    "stats": {
      "size": 75,
      "speed": 15,
      "rarity": 20,
      "danger": 25
    },
    "description": "Armed with roughly 30,000 barbed quills covering its body, this slow-moving rodent relies on its formidable defense system and pungent odor to deter even large predators like bears and cougars. Despite its vulnerability to fishers and cougars, it can live up to 30 years by climbing trees and maintaining a solitary, defensive lifestyle.",
    "image": "images/animals/004.jpg"
  },
  {
    "id": 5,
    "name": "Virginia Opossum",
    "species": "Didelphis virginiana",
    "type": "Mammal",
    "region": "Throughout North America from Costa Rica to southern Ontario; expanding northward into New England, the Great Lakes, and Pacific Northwest",
    "habitat": "Settled areas, forests, gardens, and urban environments near food sources",
    "stats": {
      "size": 35,
      "speed": 25,
      "rarity": 18,
      "danger": 8
    },
    "description": "A nocturnal marsupial that feigns death when threatened by playing completely motionless with its tongue hanging out—a defense so convincing it can last several hours. Armed with 50 teeth (more than any other North American land mammal) and an opposable thumb, it may eat up to 5,000 ticks per season to help prevent Lyme disease.",
    "image": "images/animals/005.jpg"
  }
]