[
  {
    "id": 1,
    "name": "Abert's Squirrel",
    "species": "Sciurus aberti",
    "type": "Mammal",
    "region": "Southern Rocky Mountains, Colorado Plateau (CO, NM, AZ, UT)",
    "habitat": "Ponderosa pine forests",
    "stats": {
      "size": 15,
      "speed": 55,
      "rarity": 20,
      "danger": 2
    },
    "description": "Sports dramatic ear tufts like its Eurasian cousin and lives almost exclusively in ponderosa pines, refusing to store food like other squirrels. The isolated Kaibab Plateau population evolved a striking black belly and white tail in just 10,000 years, making it a textbook example of rapid evolution.",
    "image": "images/animals/001.png"
  },
  {
    "id": 2,
    "name": "American Beaver",
    "species": "Castor canadensis",
    "type": "Mammal",
    "region": "Continental US, Canada, southern Alaska, northern Mexico",
    "habitat": "Lakes, streams, rivers with forested areas",
    "stats": {
      "size": 65,
      "speed": 35,
      "rarity": 20,
      "danger": 15
    },
    "description": "North America's largest rodent and nature's master engineer, building dams and lodges that create entire ecosystems. Nearly trapped to extinction for fancy hats, saved only by a sudden change in fashion. Can hold its breath for 15 minutes and has lips that close behind its teeth so it can gnaw underwater without drowning.",
    "image": "images/animals/002.png"
  },
  {
    "id": 3,
    "name": "American Red Squirrel",
    "species": "Tamiasciurus hudsonicus",
    "type": "Mammal",
    "region": "Most of Canada and Alaska, Rocky Mountains, northern and eastern US",
    "habitat": "Coniferous forests",
    "stats": {
      "size": 8,
      "speed": 55,
      "rarity": 20,
      "danger": 3
    },
    "description": "Defends year-round territories marked by massive middens—piles of discarded cone scales up to 12 meters across that accumulate over generations. Can safely devour mushroom species deadly to humans and hoards thousands of conifer cones in central caches to survive harsh winters. Female squirrels sometimes bequeath their territories to offspring—a rare form of maternal inheritance in the animal kingdom.",
    "image": "images/animals/003.png"
  },
  {
    "id": 4,
    "name": "Arizona Gray Squirrel",
    "species": "Sciurus arizonensis",
    "type": "Mammal",
    "region": "Eastern Arizona, New Mexico, and Northern Mexico",
    "habitat": "Mountain riparian forests with broadleaf trees",
    "stats": {
      "size": 15,
      "speed": 65,
      "rarity": 45,
      "danger": 2
    },
    "description": "Despite looking like a typical gray squirrel, this canyon dweller is actually more closely related to fox squirrels. Females only breed in years when food is abundant, timing their mating with the peak bloom of high-energy flowers. Males engage in dramatic mating chases, with multiple suitors pursuing a single female through the treetops.",
    "image": "images/animals/004.png"
  },
  {
    "id": 5,
    "name": "Delmarva Fox Squirrel",
    "species": "S. n. cinereus",
    "type": "Mammal",
    "region": "Delmarva Peninsula, Eastern Shore of Maryland and Virginia",
    "habitat": "Mature forests with open understory",
    "stats": {
      "size": 25,
      "speed": 55,
      "rarity": 45,
      "danger": 2
    },
    "description": "This silver-gray squirrel was saved from the brink after losing 90% of its population to overhunting and habitat loss. Successfully reintroduced across its historic range through innovative radio-collar tracking, it feasts on mature green pine cones in summer and prefers to den in tree hollows.",
    "image": "images/animals/005.png"
  },
  {
    "id": 6,
    "name": "Douglas Squirrel",
    "species": "Tamiasciurus douglasii",
    "type": "Mammal",
    "region": "Pacific Northwest to central California",
    "habitat": "Old-growth coniferous forests",
    "stats": {
      "size": 12,
      "speed": 65,
      "rarity": 20,
      "danger": 3
    },
    "description": "A hyperactive forest engineer that builds middens—massive piles of discarded cone scales that can grow several meters across and persist for generations. John Muir called it the most interesting and influential member of California's squirrel family, and its chattering alarm call inspired Native Americans to name it 'Pillillooeet.' Stores entire cone caches in centralized larders, sometimes robbed by humans seeking seeds for tree cultivation.",
    "image": "images/animals/006.png"
  },
  {
    "id": 7,
    "name": "Eastern Gray Squirrel",
    "species": "Sciurus carolinensis",
    "type": "Mammal",
    "region": "Eastern and Midwestern US, Southern Canada",
    "habitat": "Deciduous and mixed forests",
    "stats": {
      "size": 8,
      "speed": 55,
      "rarity": 20,
      "danger": 8
    },
    "description": "A master of memory and deception, it creates thousands of food caches each season and will fake burying nuts to throw off rivals watching from nearby. One of the few mammals that can descend trees head-first by rotating its hind feet backward to grip bark. Once described as 'truly astonishing' in population before habitat loss nearly eliminated it from Illinois by 1900.",
    "image": "images/animals/007.png"
  },
  {
    "id": 8,
    "name": "Fox Squirrel",
    "species": "Sciurus niger",
    "type": "Mammal",
    "region": "Eastern US, Great Plains, southern Canada",
    "habitat": "Open forests with oak and hickory",
    "stats": {
      "size": 18,
      "speed": 55,
      "rarity": 20,
      "danger": 5
    },
    "description": "The largest tree squirrel in North America, this acrobatic forager stores nuts for winter and isn't afraid to raid your attic. Will travel hundreds of meters from trees to forage in open fields, thriving even in crowded urban environments.",
    "image": "images/animals/008.png"
  },
  {
    "id": 9,
    "name": "Harris's Antelope Squirrel",
    "species": "Ammospermophilus harrisii",
    "type": "Mammal",
    "region": "Arizona, New Mexico, and northwestern Mexico",
    "habitat": "Sonoran Desert",
    "stats": {
      "size": 8,
      "speed": 55,
      "rarity": 20,
      "danger": 2
    },
    "description": "This desert survivor beats the heat by spreading itself spread-eagle on cool ground in a technique called \"heat dumping,\" while carrying its tail overhead like a parasol for shade. With a body temperature that can soar to 107°F, it doesn't sweat but instead cools down by salivating and seeking shadows in the scorching Sonoran Desert.",
    "image": "images/animals/009.png"
  },
  {
    "id": 10,
    "name": "Humboldt's Flying Squirrel",
    "species": "Glaucomys oregonensis",
    "type": "Mammal",
    "region": "Pacific Coast, British Columbia to Southern California",
    "habitat": "Coniferous and mixed coniferous forests",
    "stats": {
      "size": 12,
      "speed": 65,
      "rarity": 35,
      "danger": 2
    },
    "description": "Glows fluorescent pink under UV light, possibly to find mates in darkness or mimic owl plumage to confuse predators. Doesn't actually fly but glides gracefully between treetops, though it's remarkably clumsy when walking on the ground. Strictly nocturnal and thrives in old-growth forests where stable conditions allow smaller litters.",
    "image": "images/animals/010.png"
  },
  {
    "id": 11,
    "name": "Mexican Fox Squirrel",
    "species": "Sciurus nayaritensis",
    "type": "Mammal",
    "region": "Southeastern Arizona and Sierra Madre Occidental of Mexico",
    "habitat": "Pine-oak and mixed conifer mountain forests",
    "stats": {
      "size": 18,
      "speed": 55,
      "rarity": 25,
      "danger": 2
    },
    "description": "Remarkably silent and secretive, this grizzled squirrel prefers to freeze motionless rather than flee when threatened. It extracts seeds by methodically removing individual cone scales and occasionally caches food by scatter-hoarding in leaf litter. Known to communally nest in stick-and-leaf dreys high in fire-adapted forests.",
    "image": "images/animals/011.png"
  },
  {
    "id": 12,
    "name": "Mount Graham Red Squirrel",
    "species": "T. f. grahamensis",
    "type": "Mammal",
    "region": "Pinaleño Mountains, Arizona",
    "habitat": "Spruce-fir forests and mixed-conifer zones at high elevations",
    "stats": {
      "size": 12,
      "speed": 45,
      "rarity": 78,
      "danger": 2
    },
    "description": "Thought extinct in the 1950s, this tiny squirrel was rediscovered two decades later clinging to existence in a single Arizona mountain range. Uniquely lacks the white-fringed tail of its relatives and survives harsh winters without hibernating, staying active in the mid-day sun while munching on air-dried fungi and conifer cones.",
    "image": "images/animals/012.png"
  },
  {
    "id": 13,
    "name": "Mountain Beaver",
    "species": "Aplodontia rufa",
    "type": "Mammal",
    "region": "Pacific Northwest coast to Sierra Nevada",
    "habitat": "Moist forests with deep soil for burrows",
    "stats": {
      "size": 25,
      "speed": 20,
      "rarity": 20,
      "danger": 5
    },
    "description": "A living fossil with the most primitive skull structure of any living rodent, this nocturnal burrower hosts the world's largest flea—females reaching 8mm long. Despite its name, it doesn't fell trees or build dams, but thrives on toxic ferns that would poison other animals, unable to survive without constant moisture due to its inefficient kidneys.",
    "image": "images/animals/013.png"
  },
  {
    "id": 14,
    "name": "Nine-banded Armadillo",
    "species": "Dasypus novemcinctus",
    "type": "Mammal",
    "region": "Southern and Eastern US, expanding northward",
    "habitat": "Rainforests, grasslands, scrublands",
    "stats": {
      "size": 35,
      "speed": 45,
      "rarity": 20,
      "danger": 5
    },
    "description": "When startled, this armored digger can launch itself 4 feet straight up in the air, making it a highway hazard. Can cross rivers either by inflating its intestines to float or by holding its breath for six minutes and walking across the bottom.",
    "image": "images/animals/014.png"
  },
  {
    "id": 15,
    "name": "North American Porcupine",
    "species": "Erethizon dorsatum",
    "type": "Mammal",
    "region": "Canada to Appalachian Mountains, Alaska to northern Mexico",
    "habitat": "Coniferous and mixed forests, tundra",
    "stats": {
      "size": 65,
      "speed": 15,
      "rarity": 20,
      "danger": 35
    },
    "description": "Armed with 30,000 barbed quills and antibiotics in its skin to prevent self-injury, this solitary rodent has such effective defenses it can afford to be slow and nearsighted. Its quills don't fly through the air—instead they detach on contact and embed microscopic barbs deep into attackers' flesh, though fishers have learned to flip them over and attack the unprotected belly.",
    "image": "images/animals/015.png"
  },
  {
    "id": 16,
    "name": "Northern Flying Squirrel",
    "species": "Glaucomys sabrinus",
    "type": "Mammal",
    "region": "Alaska to Nova Scotia, south to North Carolina, west to Utah",
    "habitat": "Coniferous and mixed coniferous forests",
    "stats": {
      "size": 18,
      "speed": 65,
      "rarity": 20,
      "danger": 2
    },
    "description": "Despite its name, this nocturnal rodent doesn't fly but glides up to 45 meters between trees using skin membranes stretched in an X-shape. A master aerialist that can execute 90-degree turns mid-flight, yet so clumsy on the ground it would rather hide than try to run from danger. Feeds heavily on underground truffles, which it locates by smell and spatial memory.",
    "image": "images/animals/016.png"
  },
  {
    "id": 17,
    "name": "Southern Flying Squirrel",
    "species": "Glaucomys volans",
    "type": "Mammal",
    "region": "Eastern North America, southeastern Canada to Florida",
    "habitat": "Deciduous and mixed forests",
    "stats": {
      "size": 15,
      "speed": 65,
      "rarity": 20,
      "danger": 5
    },
    "description": "Doesn't actually fly but glides up to 90-degree turns around obstacles using a furry membrane stretched between its limbs. Can save 30% more energy by huddling in winter dens with up to 25 other squirrels. Has been linked to rare cases of epidemic typhus in humans through aerosolized flea and lice droppings.",
    "image": "images/animals/017.png"
  },
  {
    "id": 18,
    "name": "Southwestern Red Squirrel",
    "species": "Tamiasciurus fremonti",
    "type": "Mammal",
    "region": "Southwestern US mountain ranges",
    "habitat": "High-altitude spruce-fir and mixed coniferous forests",
    "stats": {
      "size": 12,
      "speed": 65,
      "rarity": 75,
      "danger": 2
    },
    "description": "Isolated on sky islands since the last ice age, this tree squirrel lives in fragmented mountain populations with virtually no gene flow between them. Some populations in the Sacramento Mountains diverged 130,000 years ago, making them as genetically distinct from each other as they are from their Rocky Mountain cousins.",
    "image": "images/animals/018.png"
  },
  {
    "id": 19,
    "name": "Texas Antelope Squirrel",
    "species": "Ammospermophilus interpres",
    "type": "Mammal",
    "region": "Western Texas, south-central New Mexico, northern Mexico",
    "habitat": "Desert scrublands and rocky areas near shrubs",
    "stats": {
      "size": 8,
      "speed": 45,
      "rarity": 20,
      "danger": 2
    },
    "description": "Active year-round without hibernating, this desert dweller's diet of cactus fruit can turn its flesh bright purple. An ancient lineage dating back over 10 million years, perfectly adapted to survive in the harsh Chihuahuan Desert by nesting in rock crevices and feeding on prickly pear.",
    "image": "images/animals/019.png"
  },
  {
    "id": 20,
    "name": "Virginia Opossum",
    "species": "Didelphis virginiana",
    "type": "Mammal",
    "region": "Central America to southern Canada, expanding northward",
    "habitat": "Settled areas, woodlands near food sources",
    "stats": {
      "size": 35,
      "speed": 25,
      "rarity": 20,
      "danger": 8
    },
    "description": "North America's only marsupial has 50 teeth—more than any other land mammal on the continent—and famously \"plays dead\" when threatened, complete with a putrid green fluid. Can devour up to 5,000 ticks per season, making it a natural pest controller despite its reputation as a trash-raiding nuisance.",
    "image": "images/animals/020.png"
  },
  {
    "id": 21,
    "name": "Western Gray Squirrel",
    "species": "Sciurus griseus",
    "type": "Mammal",
    "region": "Western coastal US and Mexico",
    "habitat": "Forested areas with oak and pine trees",
    "stats": {
      "size": 18,
      "speed": 55,
      "rarity": 45,
      "danger": 2
    },
    "description": "A scatter-hoarder that plants entire forests by forgetting where it buried thousands of acorns and pine nuts. Kits stay in the nest for over six months—far longer than other squirrels—making them vulnerable to faster-breeding competitors like the introduced fox squirrel that drove them from Los Angeles back into the mountains.",
    "image": "images/animals/021.png"
  }
]